<!DOCTYPE html>
<html lang="zh-Hans">
  <head>
    
<meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>


<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />



  <meta name="description" content="《精进-如何成为很厉害的人》读书笔记-复盘"/>




  <meta name="keywords" content="笔记,复盘,方法论," />




  <link rel="alternate" href="/atom.xml" title="swifty">




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=2.4.x" />



<link rel="canonical" href="http://swifty.wang/2017/06/17/book06-17/"/>


<meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5728;&amp;#x8BFB;&amp;#x300A;&amp;#x7CBE;&amp;#x8FDB;&amp;#x300B;&amp;#xFF0C;&amp;#x6587;&amp;#x4E2D;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x7AE0;&amp;#x8282;&amp;#x8BB2;&amp;#x5230;&amp;#x4E86;&amp;#x590D;&amp;#x76D8;&amp;#xFF0C;&amp;#x4E5F;&amp;#x8BB2;&amp;#x523">
<meta property="og:type" content="article">
<meta property="og:title" content="《精进-如何成为很厉害的人》读书笔记-复盘">
<meta property="og:url" content="http://swifty.wang/2017/06/17/book06-17/index.html">
<meta property="og:site_name" content="swifty">
<meta property="og:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5728;&amp;#x8BFB;&amp;#x300A;&amp;#x7CBE;&amp;#x8FDB;&amp;#x300B;&amp;#xFF0C;&amp;#x6587;&amp;#x4E2D;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x7AE0;&amp;#x8282;&amp;#x8BB2;&amp;#x5230;&amp;#x4E86;&amp;#x590D;&amp;#x76D8;&amp;#xFF0C;&amp;#x4E5F;&amp;#x8BB2;&amp;#x523">
<meta property="og:updated_time" content="2017-06-17T14:12:31.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《精进-如何成为很厉害的人》读书笔记-复盘">
<meta name="twitter:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x5728;&amp;#x8BFB;&amp;#x300A;&amp;#x7CBE;&amp;#x8FDB;&amp;#x300B;&amp;#xFF0C;&amp;#x6587;&amp;#x4E2D;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x7AE0;&amp;#x8282;&amp;#x8BB2;&amp;#x5230;&amp;#x4E86;&amp;#x590D;&amp;#x76D8;&amp;#xFF0C;&amp;#x4E5F;&amp;#x8BB2;&amp;#x523">


<link rel="stylesheet" type="text/css" href="/css/style.css?v=2.4.x" />



  <link rel="stylesheet" type="text/css" href="/lib/fancybox/jquery.fancybox.css" />





<script>
  var CONFIG = {
    search: true,
    searchPath: "/search.xml",
    fancybox: true,
    toc: true,
  }
</script>




  

  <script type="text/javascript">
    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
        })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

        ga('create', 'UA-100842511-1', 'auto');
        ga('send', 'pageview');
  </script>



    <title> 《精进-如何成为很厉害的人》读书笔记-复盘 · swifty </title>
  </head>

  <body><div id="mobile-navbar" class="mobile-navbar">
  <div class="mobile-header-logo">
    <a href="/." class="logo">swifty</a>
  </div>
  <div class="mobile-navbar-icon">
    <span></span>
    <span></span>
    <span></span>
  </div>
</div>

<nav id="mobile-menu" class="mobile-menu slideout-menu">
  <ul class="mobile-menu-list">
    
      <a href="/">
        <li class="mobile-menu-item">
          
          
            Home
          
        </li>
      </a>
    
      <a href="/archives/">
        <li class="mobile-menu-item">
          
          
            Archives
          
        </li>
      </a>
    
      <a href="/tags">
        <li class="mobile-menu-item">
          
          
            Tags
          
        </li>
      </a>
    
      <a href="/categories">
        <li class="mobile-menu-item">
          
          
            Categories
          
        </li>
      </a>
    
      <a href="/about">
        <li class="mobile-menu-item">
          
          
            About
          
        </li>
      </a>
    
  </ul>
</nav>

    <div class="container" id="mobile-panel">
      <header id="header" class="header"><div class="logo-wrapper">
  <a href="/." class="logo">swifty</a>
</div>

<nav class="site-navbar">
  
    <ul id="menu" class="menu">
      
        <li class="menu-item">
          <a class="menu-item-link" href="/">
            
            
              Home
            
          </a>
        </li>
      
        <li class="menu-item">
          <a class="menu-item-link" href="/archives/">
            
            
              Archives
            
          </a>
        </li>
      
        <li class="menu-item">
          <a class="menu-item-link" href="/tags">
            
            
              Tags
            
          </a>
        </li>
      
        <li class="menu-item">
          <a class="menu-item-link" href="/categories">
            
            
              Categories
            
          </a>
        </li>
      
        <li class="menu-item">
          <a class="menu-item-link" href="/about">
            
            
              About
            
          </a>
        </li>
      
      
        <li class="menu-search">
          <form>
            <i class="iconfont icon-search" id="open-search"></i>
            <input type="text" class="search-input" id="search-input" />
            <i class="iconfont icon-close" id="close-search"></i>
          </form>
        </li>
      
    </ul>
  
</nav>

      </header>

      <main id="main" class="main">
        <div class="content-wrapper">
          <div id="content" class="content">
            
  
  <article class="post">
    <header class="post-header">
      <h1 class="post-title">
        
          《精进-如何成为很厉害的人》读书笔记-复盘
        
      </h1>

      <div class="post-meta">
        <span class="post-time">
          Jun 17, 2017
        </span>
      </div>
    </header>

    
    

    <div class="post-content">
      
        <p><iframe frameborder="no" border="0" marginwidth="0" marginheight="0" width="330" height="86" src="//music.163.com/outchain/player?type=2&amp;id=19673369&amp;auto=1&amp;height=66"></iframe></p>
<blockquote>
<p>&#x6700;&#x8FD1;&#x5728;&#x8BFB;&#x300A;&#x7CBE;&#x8FDB;&#x300B;&#xFF0C;&#x6587;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x7AE0;&#x8282;&#x8BB2;&#x5230;&#x4E86;&#x590D;&#x76D8;&#xFF0C;&#x4E5F;&#x8BB2;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x590D;&#x76D8;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x611F;&#x89C9;&#x5F88;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x7279;&#x6574;&#x7406;&#x5982;&#x4E0B;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
</blockquote>
<p>&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x662F;&#x590D;&#x76D8;&#x5462;&#xFF1F;&#x7B80;&#x5355;&#x6765;&#x8BB2;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x603B;&#x7ED3;&#x6027;&#x7684;&#x601D;&#x7EF4;&#x3002;&#x5C31;&#x6BD4;&#x5982;&#x8BF4;&#x6211;&#x4EEC;&#x6BCF;&#x5929;&#x7684;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6240;&#x76EE;&#x4E4B;&#x6240;&#x53CA;&#x7684;&#xFF0C;&#x770B;&#x5230;&#x542C;&#x5230;&#x7684;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x8868;&#x8C61;&#x3002;&#x5982;&#x679C;&#x8981;&#x900F;&#x8FC7;&#x8868;&#x8C61;&#x770B;&#x5230;&#x66F4;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x89C2;&#x5BDF;&#x548C;&#x601D;&#x8003;&#x3002;&#x4E66;&#x4E2D;&#x4E66;&#x5230;&#xFF1A;&#x5728;&#x8868;&#x8C61;&#x4E4B;&#x4E0A;&#xFF0C;&#x662F;&#x7ECF;&#x7531;&#x5F52;&#x7EB3;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x7684;&#x7ECF;&#x9A8C;&#x3001;&#x5047;&#x8BBE;&#x548C;&#x6A21;&#x578B;&#xFF1B;&#x5728;&#x8868;&#x8C61;&#x4E4B;&#x4E0B;&#xFF0C;&#x662F;&#x5927;&#x91CF;&#x66F4;&#x52A0;&#x771F;&#x5B9E;&#x4E0E;&#x7E41;&#x5BC6;&#x7684;&#x7EC6;&#x8282;&#x6027;&#x4FE1;&#x606F;&#x3002;&#x90A3;&#x4E48;&#x53CD;&#x601D;&#x548C;&#x884C;&#x52A8;&#xFF0C;&#x5C31;&#x6210;&#x4E86;&#x5728;&#x8FD9;&#x4E09;&#x8005;&#x4E4B;&#x95F4;&#x6298;&#x8FD4;&#x7684;&#x6865;&#x6881;&#xFF1B;&#x53CD;&#x601D;&#x548C;&#x884C;&#x52A8;&#x8D8A;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8D8A;&#x80FD;&#x4ECE;&#x8868;&#x8C61;&#x8FC7;&#x6E21;&#x5230;&#x66F4;&#x591A;&#x7684;&#x62BD;&#x8C61;&#x7406;&#x5FF5;&#x548C;&#x5177;&#x8C61;&#x4E8B;&#x5B9E;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x590D;&#x76D8;&#x3002;<br><a id="more"></a><br>&#x65E5;&#x672C;&#x7684;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x5927;&#x5E08;&#x91CE;&#x4E2D;&#x90C1;&#x6B21;&#x90CE;&#x8BA4;&#x4E3A;&#xFF1A;&#x77E5;&#x8BC6;&#x521B;&#x9020;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x9690;&#x6027;&#x77E5;&#x8BC6;&#x548C;&#x663E;&#x6027;&#x77E5;&#x8BC6;&#x76F8;&#x4E92;&#x8F6C;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4ECE;&#x663E;&#x6027;&#x77E5;&#x8BC6;&#x5230;&#x9690;&#x6027;&#x77E5;&#x8BC6;&#x7684;&#x8F6C;&#x5316;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x77E5;&#x8BC6;&#x7684;&#x5185;&#x5316;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x5B9E;&#x9645;&#x7684;&#x7EC3;&#x4E60;&#x6765;&#x638C;&#x63E1;&#x4E66;&#x4E2D;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x4ECE;&#x9690;&#x6027;&#x77E5;&#x8BC6;&#x5230;&#x663E;&#x6027;&#x77E5;&#x8BC6;&#x7684;&#x8F6C;&#x5316;&#xFF0C;&#x5219;&#x662F;&#x77E5;&#x8BC6;&#x7684;&#x663E;&#x5316;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5BF9;&#x884C;&#x52A8;&#x8FDB;&#x884C;&#x7EC6;&#x81F4;&#x7684;&#x53CD;&#x601D;&#xFF0C;&#x628A;&#x90A3;&#x4E9B;&#x539F;&#x672C;&#x5E76;&#x975E;&#x7528;&#x8BED;&#x8A00;&#x627F;&#x8F7D;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x7528;&#x8BED;&#x8A00;&#x5F52;&#x7EB3;&#x548C;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x4E00;&#x65E6;&#x53EF;&#x4EE5;&#x7528;&#x8BED;&#x8A00;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#xFF0C;&#x5C31;&#x5BB9;&#x6613;&#x88AB;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x548C;&#x8FC1;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E2D;&#x3002;<br>&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x90A3;&#x4E9B;&#xFF1A;&#x8BFB;&#x8FC7;&#x4E66;&#xFF0C;&#x770B;&#x8FC7;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x7ECF;&#x5386;&#x7684;&#x6F14;&#x8BB2;&#xFF0C;&#x53C2;&#x52A0;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x751A;&#x81F3;&#x4E86;&#x89E3;&#x62C9;&#x9762;&#x5E08;&#x5085;&#x600E;&#x6837;&#x624D;&#x80FD;&#x6765;&#x5904;&#x5F88;&#x7EC6;&#x7684;&#x9762;&#x6761;&#x6765;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x751F;&#x6D3B;&#x7684;&#x79CD;&#x79CD;&#xFF0C;&#x600E;&#x4E48;&#x8981;&#x600E;&#x4E48;&#x6765;&#x66F4;&#x597D;&#x7684;&#x53BB;&#x601D;&#x8003;&#xFF0C;&#x53BB;&#x53CD;&#x601D;&#xFF0C;&#x4EE5;&#x53CA;&#x590D;&#x76D8;&#x5462;&#xFF1F;&#x4F5C;&#x8005;&#x7ED9;&#x51FA;&#x4E0B;&#x9762;&#x7684;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<blockquote>
<p>&#x4FE1;&#x606F;</p>
</blockquote>
<ul>
<li>&#x5728;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x65F6;&#x6211;&#x5229;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#xFF1F;&#x5176;&#x4E2D;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#xFF1F;<br>-&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x662F;&#x4ECE;&#x54EA;&#x4E9B;&#x6E20;&#x9053;&#x4E2D;&#x5F97;&#x6765;&#x7684;&#xFF1F;&#x54EA;&#x4E9B;&#x6E20;&#x9053;&#x88AB;&#x8BC1;&#x660E;&#x662F;&#x5F88;&#x6709;&#x4EF7;&#x503C;&#x7684;&#xFF1F;</li>
<li>&#x6211;&#x53EF;&#x80FD;&#x9057;&#x6F0F;&#x4E86;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#xFF1F;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x600E;&#x4E48;&#x5F97;&#x5230;&#xFF1F;<blockquote>
<p>&#x9884;&#x671F;</p>
</blockquote>
</li>
<li>&#x5728;&#x505A;&#x4E8B;&#x4E4B;&#x524D;&#xFF0C;&#x662F;&#x5426;&#x5BF9;&#x4E8B;&#x60C5;&#x7684;&#x8FC7;&#x7A0B;&#x548C;&#x7ED3;&#x679C;&#x5F62;&#x6210;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x9884;&#x671F;&#xFF1F;</li>
<li>&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x5F62;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x9884;&#x671F;&#xFF1F;&#x662F;&#x4EC0;&#x4E48;&#x9020;&#x6210;&#x4E86;&#x9884;&#x671F;&#x548C;&#x4E8B;&#x5B9E;&#x4E4B;&#x95F4;&#x7684;&#x504F;&#x5DEE;&#xFF1F;</li>
<li>&#x6211;&#x7684;&#x9884;&#x671F;&#x662F;&#x5426;&#x4FC3;&#x8FDB;&#x6216;&#x8005;&#x963B;&#x788D;&#x4E86;&#x4E8B;&#x60C5;&#x7684;&#x8FDB;&#x7A0B;&#xFF1F;&#x4ECA;&#x540E;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x9884;&#x671F;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x7ED3;&#x679C;</p>
</blockquote>
<ul>
<li>&#x600E;&#x6837;&#x63CF;&#x8FF0;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x7ED3;&#x679C;&#xFF1F;&#x600E;&#x6837;&#x8BC4;&#x4EF7;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x7ED3;&#x679C;&#xFF1F;</li>
<li>&#x5728;&#x63CF;&#x8FF0;&#x548C;&#x8BC4;&#x4EF7;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x7ED3;&#x679C;&#x65F6;&#x6211;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x6307;&#x6807;&#xFF1F;&#x8FD9;&#x4E9B;&#x6307;&#x6807;&#x662F;&#x5426;&#x9700;&#x8981;&#x6539;&#x8FDB;&#xFF1F;</li>
<li>&#x7ED3;&#x679C;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x6539;&#x8FDB;&#xFF1F;&#x5982;&#x4F55;&#x6539;&#x8FDB;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x8FDB;&#x5EA6;</p>
</blockquote>
<ul>
<li>&#x4E8B;&#x4EF6;&#x7684;&#x8FDB;&#x5EA6;&#x5408;&#x9002;&#x5417;&#xFF0C;&#x662F;&#x592A;&#x5FEB;&#x4E86;&#x8FD8;&#x662F;&#x592A;&#x6162;&#x4E86;&#xFF1F;&#x662F;&#x4EC0;&#x4E48;&#x56E0;&#x7D20;&#x5BFC;&#x81F4;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x679C;&#xFF1F;</li>
<li>&#x5F53;&#x8FDB;&#x5EA6;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#x4F7F;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x624B;&#x6BB5;&#x8FDB;&#x884C;&#x5E72;&#x9884;&#xFF1F;&#x6548;&#x679C;&#x5982;&#x4F55;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#x7406;&#x60F3;&#x6216;&#x8005;&#x4E0D;&#x7406;&#x60F3;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x5DE5;&#x5177;</p>
</blockquote>
<ul>
<li>&#x5728;&#x5B8C;&#x6210;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x5DE5;&#x5177;&#xFF1F;</li>
<li>&#x54EA;&#x4E9B;&#x5DE5;&#x5177;&#x8D77;&#x5230;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x4FC3;&#x8FDB;&#x4F5C;&#x7528;&#xFF1F;&#x54EA;&#x4E9B;&#x5DE5;&#x5177;&#x8D77;&#x5230;&#x4E86;&#x963B;&#x788D;&#x4F5C;&#x7528;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x6539;&#x8FDB;&#x73B0;&#x6709;&#x7684;&#x5DE5;&#x5177;&#x4F7F;&#x5176;&#x53D1;&#x6325;&#x66F4;&#x597D;&#x7684;&#x529F;&#x6548;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x60C5;&#x7EEA;</p>
</blockquote>
<ul>
<li>&#x5728;&#x505A;&#x4E8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x7684;&#x60C5;&#x7EEA;&#x72B6;&#x6001;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF1F;&#x662F;&#x5426;&#x51FA;&#x73B0;&#x8FC7;&#x60C5;&#x7EEA;&#x5931;&#x63A7;&#x7684;&#x60C5;&#x51B5;&#xFF1F;&#x662F;&#x4EC0;&#x4E48;&#x5F15;&#x53D1;&#x7684;&#xFF1F;</li>
<li>&#x6211;&#x662F;&#x5426;&#x6709;&#x610F;&#x8BC6;&#x5730;&#x8C03;&#x6574;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x7EEA;&#xFF1F;&#x5728;&#x8FD9;&#x671F;&#x95F4;&#x4F7F;&#x7528;&#x4E86;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF1F;&#x662F;&#x5426;&#x9700;&#x8981;&#x6539;&#x8FDB;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x963B;&#x788D;</p>
</blockquote>
<ul>
<li>&#x5728;&#x505A;&#x4E8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x963B;&#x788D;&#xFF1F;&#x5176;&#x4E2D;&#x6700;&#x91CD;&#x5927;&#x7684;&#x963B;&#x788D;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x6211;&#x662F;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x8FD9;&#x4E9B;&#x963B;&#x788D;&#x7684;&#xFF1F;&#x53D6;&#x5F97;&#x4E86;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#xFF1F;&#x8FD9;&#x4E9B;&#x963B;&#x788D;&#x4E2D;&#x54EA;&#x4E9B;&#x4F1A;&#x957F;&#x671F;&#x5B58;&#x5728;&#xFF1F;</li>
<li>&#x6211;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4EC0;&#x4E48;&#x6301;&#x7EED;&#x7684;&#x52AA;&#x529B;&#x6765;&#x51CF;&#x5C11;&#x8FD9;&#x4E9B;&#x963B;&#x788D;&#xFF1F; </li>
</ul>
<blockquote>
<p>&#x4F18;&#x52BF;</p>
</blockquote>
<ul>
<li>&#x5728;&#x505A;&#x4E8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x53D1;&#x6325;&#x4E86;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4F18;&#x52BF;&#xFF1F;&#x662F;&#x5426;&#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x52BF;&#x8FD8;&#x6CA1;&#x6709;&#x5229;&#x7528;&#x548C;&#x53D1;&#x6325;&#x7684;&#xFF1F;</li>
<li>&#x5728;&#x505A;&#x4E8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x7684;&#x4E3B;&#x8981;&#x6536;&#x83B7;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x6211;&#x7684;&#x54EA;&#x4E9B;&#x77E5;&#x8BC6;&#x548C;&#x80FD;&#x529B;&#x5F97;&#x5230;&#x4E86;&#x63D0;&#x5347;&#xFF1F;</li>
<li>&#x6211;&#x53EF;&#x4EE5;&#x5411;&#x505A;&#x540C;&#x7C7B;&#x4E8B;&#x60C5;&#x7684;&#x5176;&#x4ED6;&#x4EBA;&#x5B66;&#x4E60;&#x4EC0;&#x4E48;&#xFF1F;&#x4ED6;&#x4EEC;&#x6709;&#x54EA;&#x4E9B;&#x4F18;&#x52BF;&#x662F;&#x6211;&#x4E0D;&#x5177;&#x5907;&#x7684;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x7F3A;&#x61BE;</p>
</blockquote>
<ul>
<li>&#x5728;&#x505A;&#x4E8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x7684;&#x9057;&#x61BE;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x6700;&#x5927;&#x7684;&#x9057;&#x61BE;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x9020;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x9057;&#x61BE;&#xFF1F;</li>
<li>&#x5728;&#x505A;&#x4E8B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x66B4;&#x9732;&#x4E86;&#x54EA;&#x4E9B;&#x7F3A;&#x70B9;&#xFF1F;&#x5176;&#x4E2D;&#x54EA;&#x4E9B;&#x7F3A;&#x70B9;&#x662F;&#x5FC5;&#x987B;&#x4E14;&#x8FEB;&#x5207;&#x9700;&#x8981;&#x6539;&#x6B63;&#x7684;&#xFF1F;</li>
<li>&#x5173;&#x4E8E;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x522B;&#x4EBA;&#x5BF9;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x6279;&#x8BC4;&#x548C;&#x8BC4;&#x4EF7;&#xFF1F;&#x4ED6;&#x4EEC;&#x7684;&#x6279;&#x8BC4;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x53D6;&#x4E4B;&#x5904;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x610F;&#x4E49;</p>
</blockquote>
<ul>
<li>&#x8FD9;&#x4EF6;&#x4E8B;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x6700;&#x5927;&#x7684;&#x610F;&#x4E49;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5BF9;&#x6211;&#x7684;&#x77ED;&#x671F;&#x751F;&#x6D3B;&#x548C;&#x957F;&#x671F;&#x751F;&#x6D3B;&#x5206;&#x522B;&#x6709;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF1F;</li>
<li>&#x8FD9;&#x4EF6;&#x4E8B;&#x5BF9;&#x5468;&#x56F4;&#x4EBA;&#x3001;&#x5BF9;&#x793E;&#x4F1A;&#x3001;&#x5BF9;&#x6574;&#x4E2A;&#x4E16;&#x754C;&#x548C;&#x5BF9;&#x5730;&#x7403;&#x7684;&#x610F;&#x4E49;&#x5206;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x6211;&#x53D1;&#x73B0;&#x4E86;&#x54EA;&#x4E9B;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x610F;&#x4E49;&#xFF1F;</li>
</ul>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x51E0;&#x4E2A;&#x8DEF;&#x5F84;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x5F88;&#x6E05;&#x6670;&#x7684;&#x68B3;&#x7406;&#x51FA;&#x5BF9;&#x4E8E;&#x884C;&#x52A8;&#x4E2D;&#x6240;&#x8981;&#x5206;&#x6790;&#x7684;&#x70B9;&#x3002;&#x90A3;&#x4E48;&#x9488;&#x5BF9;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x6700;&#x4E3A;&#x7B80;&#x5355;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;&#x4EE5;&#x4E0A;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x6A21;&#x677F;&#x6765;&#x8BB2;&#xFF0C;&#x5F88;&#x662F;&#x9002;&#x5408;&#x3002;<br>&#x5F53;&#x7136;&#x9664;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x4E8E;&#x590D;&#x76D8;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5173;&#x952E;&#x70B9;&#xFF1A;</p>
<blockquote>
<p>&#x53CA;&#x65F6;&#x53CD;&#x601D;</p>
</blockquote>
<p>&#x53CD;&#x601D;&#x4E00;&#x5B9A;&#x8981;&#x53CA;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x505A;&#x8FC7;&#x4E86;&#x5F88;&#x4E45;&#x518D;&#x53BB;&#x53CD;&#x601D;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x8BB0;&#x5FC6;&#x4E2D;&#x4F1A;&#x4E27;&#x5931;&#x5927;&#x91CF;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x76F8;&#x5173;&#x7EC6;&#x8282;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x8BB0;&#x5FC6;&#x4E2D;&#x7684;&#x9057;&#x5FD8;&#x548C;&#x626D;&#x66F2;&#x7684;&#x662F;&#x6700;&#x5C11;&#xFF0C;&#x8BF7;&#x5728;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x8BB0;&#x5F55;&#x3001;&#x601D;&#x8003;&#x3001;&#x53CD;&#x601D;&#x3002;&#x5F53;&#x7136;&#x672A;&#x5FC5;&#x8FC7;&#x4E8E;&#x6B63;&#x5F0F;&#xFF0C;&#x54EA;&#x6015;&#x53EA;&#x662F;&#x4F4E;&#x5934;&#x601D;&#x8003;&#x51E0;&#x5206;&#x949F;&#x4E5F;&#x6BD4;&#x4E0D;&#x505A;&#x8981;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x6761;&#x4EF6;&#x5141;&#x8BB8;&#xFF0C;&#x80FD;&#x5C06;&#x53CD;&#x601D;&#x5185;&#x5BB9;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x66F4;&#x662F;&#x518D;&#x597D;&#x4E0D;&#x8FC7;&#x3002;</p>
<blockquote>
<p>&#x68B3;&#x7406;&#x53CD;&#x5E94;&#x94FE;</p>
</blockquote>
<p>&#x4F5C;&#x8005;&#x8BF4;&#x68B3;&#x7406;&#x53CD;&#x5E94;&#x94FE;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x4E8B;&#x4EF6;&#x80CC;&#x540E;&#x7684;&#x8FD0;&#x884C;&#x673A;&#x5236;&#x3002;&#x5C31;&#x6BD4;&#x5982;&#x9605;&#x8BFB;&#x4E00;&#x672C;&#x4E66;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x770B;&#x51FA;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x8109;&#x7EDC;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x53CD;&#x601D;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x8FD9;&#x4EF6;&#x4E8B;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5F00;&#x59CB;&#x3001;&#x53D1;&#x5C55;&#x3001;&#x8F6C;&#x6298;&#x3001;&#x7ED3;&#x675F;&#x7684;&#xFF0C;&#x5176;&#x80CC;&#x540E;&#x7684;&#x52A8;&#x56E0;&#x3001;&#x963B;&#x529B;&#x4EE5;&#x53CA;&#x5173;&#x8282;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD9;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x56E0;&#x7D20;&#x53C8;&#x662F;&#x5982;&#x4F55;&#x4E32;&#x8054;&#x8D77;&#x4E00;&#x6761;&#x5B8C;&#x6574;&#x7684;&#x53CD;&#x5E94;&#x94FE;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x5173;&#x6CE8;&#x610F;&#x5916;</p>
</blockquote>
<p>&#x5728;&#x505A;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x5145;&#x5206;&#x7684;&#x51C6;&#x5907;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x4E0D;&#x53EF;&#x63A7;&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x3002;&#x4F46;&#x662F;&#x5728;&#x884C;&#x52A8;&#x4E2D;&#xFF0C;&#x603B;&#x662F;&#x514D;&#x4E0D;&#x4E86;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x548C;&#x73B0;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6709;&#x4E9B;&#x7ED3;&#x679C;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x671F;&#x5F85;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8BA9;&#x6211;&#x4EEC;&#x5927;&#x5931;&#x6240;&#x671B;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x628A;&#x6211;&#x4EEC;&#x60CA;&#x5F97;&#x76EE;&#x77AA;&#x53E3;&#x5446;&#x3002;&#x610F;&#x5916;&#x7ED3;&#x679C;&#x4E5F;&#x8BB8;&#x5E76;&#x975E;&#x672C;&#x8EAB;&#x6709;&#x591A;&#x7279;&#x522B;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4E8E;&#x5B83;&#x843D;&#x5728;&#x6211;&#x4EEC;&#x539F;&#x6709;&#x7684;&#x8BA4;&#x77E5;&#x4E4B;&#x5916;&#x3002;&#x56E0;&#x6B64;&#x5173;&#x6CE8;&#x610F;&#x5916;&#x4E8B;&#x4EF6;&#x5C31;&#x662F;&#x6253;&#x5F00;&#x6211;&#x4EEC;&#x8BA4;&#x77E5;&#x5C40;&#x9650;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x7531;&#x4E8E;&#x666E;&#x904D;&#x5B58;&#x5728;&#x7684;&#x201C;&#x8BC1;&#x5B9E;&#x504F;&#x89C1;&#x201D;&#xFF0C;&#x4EBA;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x7B26;&#x5408;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x628A;&#x610F;&#x5916;&#x7684;&#x6548;&#x5E94;&#x7F6E;&#x4E4B;&#x4E0D;&#x7406;&#xFF0C;&#x6216;&#x8005;&#x7B80;&#x5355;&#x5730;&#x5F52;&#x7ED3;&#x4E3A;&#x968F;&#x673A;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x53CD;&#x601D;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x523B;&#x610F;&#x4FDD;&#x6301;&#x5BF9;&#x610F;&#x5916;&#x73B0;&#x8C61;&#x7684;&#x654F;&#x611F;&#xFF0C;&#x514B;&#x670D;&#x539F;&#x6709;&#x7684;&#x601D;&#x7EF4;&#x60F0;&#x6027;&#xFF0C;&#x901A;&#x8FC7;&#x7406;&#x89E3;&#x610F;&#x5916;&#x6765;&#x62D3;&#x5C55;&#x8BA4;&#x77E5;&#x548C;&#x884C;&#x52A8;&#x7684;&#x8FB9;&#x754C;&#x3002;<br>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x300A;&#x7CBE;&#x8FDB;&#x300B;&#x4E2D;&#x5173;&#x4E8E;&#x590D;&#x76D8;&#x7684;&#x6240;&#x76F8;&#x5173;&#x89E3;&#x8BFB;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x63A8;&#x8350;&#x53BB;&#x9605;&#x8BFB;&#x4E0B;&#x6539;&#x4E66;&#x3002;</p>

      
    </div>

    
      
      

  <div class="post-copyright">
    <p class="copyright-item">
      <span>作者: </span>
      <span>沐风</span>
    </p>
    <p class="copyright-item">
      <span>来源: </span>
      <a href="http://swifty.wang">http://swifty.wang</a>
    </p>
    <p class="copyright-item">
      <span>链接: </span>
      <a href="http://swifty.wang/2017/06/17/book06-17/">http://swifty.wang/2017/06/17/book06-17/</a>
    </p>

    <p class="copyright-item lincese">
      
      本文采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/" target="_blank">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
    </p>
  </div>



      
      
  <div class="post-reward">
    <input type="checkbox" name="reward" id="reward" hidden />
    <label class="reward-button" for="reward">赞赏支持</label>
    <div class="qr-code">
      
      
        <label class="qr-code-image" for="reward">
          <img class="image" src="/image/reward/wechat.png" title="wechat">
        </label>
      
      
        <label class="qr-code-image" for="reward">
          <img class="image" src="/image/reward/alipay.png" title="alipay">
        </label>
      
    </div>
  </div>

    

    
      <footer class="post-footer">
        
          <div class="post-tags">
            
              <a href="/tags/笔记/">笔记</a>
            
              <a href="/tags/复盘/">复盘</a>
            
              <a href="/tags/方法论/">方法论</a>
            
          </div>
        
        
        
  <nav class="post-nav">
    
      <a class="prev" href="/2017/06/29/20170629的副本111/">
        <i class="iconfont icon-left"></i>
        <span class="prev-text nav-default">Swift：类和结构体小结</span>
        <span class="prev-text nav-mobile">Prev</span>
      </a>
    
    
      <a class="next" href="/2017/06/11/myMovieRecords/">
        <span class="next-text nav-default">2017上半年电影记录</span>
        <span class="prev-text nav-mobile">Next</span>
        <i class="iconfont icon-right"></i>
      </a>
    
  </nav>

      </footer>
    

  </article>


          </div>
          
  <div class="comments" id="comments">
    
      <div id="cloud-tie-wrapper" class="cloud-tie-wrapper"></div>
    
  </div>


        </div>  
      </main>

      <footer id="footer" class="footer">

  <div class="social-links">
    
      
        
          <a href="mailto:sdhzwm@gmail.com" class="iconfont icon-email" title="email"></a>
        
      
    
      
        
          <a href="https://github.com/sdhzwm" class="iconfont icon-github" title="github"></a>
        
      
    
    
    
  </div>


<div class="copyright">
  <span class="power-by">
    Powered by <a class="hexo-link" href="https://hexo.io/">Hexo</a>
  </span>
  
  <span class="theme-info">
    Theme - 
    <a class="theme-link" href="https://github.com/ahonn/hexo-theme-even">Even</a>
  </span>

  <span class="copyright-year">
    
    &copy; 
     
      2016 - 
    
    2017

    <span class="heart">
      <i class="iconfont icon-heart"></i>
    </span>
    <span class="author">沐风</span>
  </span>
</div>
      </footer>

      <div class="back-to-top" id="back-to-top">
        <i class="iconfont icon-up"></i>
      </div>
    </div>

    
  

  
  
  <script>
    var cloudTieConfig = {
      url: document.location.href, 
      sourceId: "",
      productKey: "fe5d3a09757049dfb98df7a45ef93154",
      target: "cloud-tie-wrapper"
    };
  </script>
  <script src="https://img1.cache.netease.com/f2e/tie/yun/sdk/loader.js"></script>





    
  





  
    <script type="text/javascript" src="/lib/jquery/jquery-3.1.1.min.js"></script>
  

  
    <script type="text/javascript" src="/lib/slideout/slideout.js"></script>
  

  
    <script type="text/javascript" src="/lib/fancybox/jquery.fancybox.pack.js"></script>
  


    <script type="text/javascript" src="/js/src/even.js?v=2.4.x"></script>
<script type="text/javascript" src="/js/src/bootstrap.js?v=2.4.x"></script>

    
  <script type="text/html" id="search-result">
    <article class="post">
      <header class="post-header">
        <h1 class="post-title">
          <a href="$url$" class="post-link">
            $title$
          </a>
        </h1>
      </header>
      <div class="post-content">
        $content$
        <div class="read-more">
          <a href="$url$" class="read-more-link">
            Read more..
          </a>
        </div>
      </div>
    </article>
  </script>
  <script type="text/html" id="no-search-result">
    <div class="no-result">
      <h2>No result found!</h2>
    </div>
  </script>
  <script type="text/javascript" src="/js/src/search.js?v=2.4.x"></script>

  </body>
</html>
